Oryx-Embedded/CycloneTCP/drivers/mac/mcxe31b_eth_driver.c
/**
 * @file mcxe31b_eth_driver.c
 * @brief NXP MCX E31B Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "fsl_device_registers.h"
#include "fsl_clock.h"
#include "fsl_memory.h"
#include "fsl_siul2.h"
#include "core/net.h"
#include "drivers/mac/mcxe31b_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
#pragma location = MCXE31B_ETH_RAM_SECTION
static uint8_t txBuffer[MCXE31B_ETH_TX_BUFFER_COUNT][MCXE31B_ETH_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
#pragma location = MCXE31B_ETH_RAM_SECTION
static uint8_t rxBuffer[MCXE31B_ETH_RX_BUFFER_COUNT][MCXE31B_ETH_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 4
#pragma location = MCXE31B_ETH_RAM_SECTION
static Mcxe31bTxDmaDesc txDmaDesc[MCXE31B_ETH_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 4
#pragma location = MCXE31B_ETH_RAM_SECTION
static Mcxe31bRxDmaDesc rxDmaDesc[MCXE31B_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[MCXE31B_ETH_TX_BUFFER_COUNT][MCXE31B_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(MCXE31B_ETH_RAM_SECTION)));
//Receive buffer
static uint8_t rxBuffer[MCXE31B_ETH_RX_BUFFER_COUNT][MCXE31B_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(MCXE31B_ETH_RAM_SECTION)));
//Transmit DMA descriptors
static Mcxe31bTxDmaDesc txDmaDesc[MCXE31B_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(4), __section__(MCXE31B_ETH_RAM_SECTION)));
//Receive DMA descriptors
static Mcxe31bRxDmaDesc rxDmaDesc[MCXE31B_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(4), __section__(MCXE31B_ETH_RAM_SECTION)));

#endif

//Current transmit descriptor
static uint_t txIndex;
//Current receive descriptor
static uint_t rxIndex;


/**
 * @brief MCX E31B Ethernet MAC driver
 **/

const NicDriver mcxe31bEthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   mcxe31bEthInit,
   mcxe31bEthTick,
   mcxe31bEthEnableIrq,
   mcxe31bEthDisableIrq,
   mcxe31bEthEventHandler,
   mcxe31bEthSendPacket,
   mcxe31bEthUpdateMacAddrFilter,
   mcxe31bEthUpdateMacConfig,
   mcxe31bEthWritePhyReg,
   mcxe31bEthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief MCX E31B Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t mcxe31bEthInit(NetInterface *interface)
{
   error_t error;
   uint32_t temp;

   //Debug message
   TRACE_INFO("Initializing MCX E31B Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   mcxe31bEthInitGpio(interface);

   //Enable EMAC peripheral clock
   CLOCK_EnableClock(kCLOCK_Emac);

   //Perform a software reset
   EMAC->DMA_MODE |= EMAC_DMA_MODE_SWR_MASK;
   //Wait for the reset to complete
   while((EMAC->DMA_MODE & EMAC_DMA_MODE_SWR_MASK) != 0)
   {
   }

   //Adjust MDC clock range depending on CSR frequency
   EMAC->MAC_MDIO_ADDRESS = EMAC_MAC_MDIO_ADDRESS_CR(4);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   EMAC->MAC_CONFIGURATION = EMAC_MAC_CONFIGURATION_GPSLCE_MASK |
      EMAC_MAC_CONFIGURATION_PS_MASK | EMAC_MAC_CONFIGURATION_DO_MASK;

   //Set the maximum packet size that can be accepted
   temp = EMAC->MAC_EXT_CONFIGURATION & ~EMAC_MAC_EXT_CONFIGURATION_GPSL_MASK;
   EMAC->MAC_EXT_CONFIGURATION = temp | MCXE31B_ETH_RX_BUFFER_SIZE;

   //Configure MAC address filtering
   mcxe31bEthUpdateMacAddrFilter(interface);

   //Disable flow control
   EMAC->MAC_TX_FLOW_CTRL_Q[0] = 0;
   EMAC->MAC_RX_FLOW_CTRL = 0;

   //Enable the first RX queue
   EMAC->MAC_RXQ_CTRL[0] = EMAC_MAC_RXQ_CTRL_RXQ0EN(2);

   //Configure DMA operating mode
   EMAC->DMA_MODE = EMAC_DMA_MODE_PR(0);
   //Configure system bus mode
   EMAC->DMA_SYSBUS_MODE |= EMAC_DMA_SYSBUS_MODE_AAL_MASK;

   //The DMA takes the descriptor table as contiguous
   EMAC->DMA_CH[0].DMA_CHX_CTRL = EMAC_DMA_CHX_CTRL_DSL(0);
   //Configure TX features
   EMAC->DMA_CH[0].DMA_CHX_TX_CTRL = EMAC_DMA_CHX_TX_CTRL_TxPBL(32);

   //Configure RX features
   EMAC->DMA_CH[0].DMA_CHX_RX_CTRL = EMAC_DMA_CHX_RX_CTRL_RxPBL(32) |
      EMAC_DMA_CHX_RX_CTRL_RBSZ_13_y(MCXE31B_ETH_RX_BUFFER_SIZE / 4);

   //Enable store and forward mode for transmission
   EMAC->MTL_QUEUE[0].MTL_TXQX_OP_MODE |= EMAC_MTL_TXQX_OP_MODE_TQS(7) |
      EMAC_MTL_TXQX_OP_MODE_TXQEN(2) | EMAC_MTL_TXQX_OP_MODE_TSF_MASK;

   //Enable store and forward mode for reception
   EMAC->MTL_QUEUE[0].MTL_RXQX_OP_MODE |= EMAC_MTL_RXQX_OP_MODE_RQS(7) |
      EMAC_MTL_RXQX_OP_MODE_RSF_MASK;

   //Initialize DMA descriptor lists
   mcxe31bEthInitDmaDesc(interface);

   //Prevent interrupts from being generated when statistic counters reach
   //half their maximum value
   EMAC->MMC_TX_INTERRUPT_MASK = 0xFFFFFFFF;
   EMAC->MMC_RX_INTERRUPT_MASK = 0xFFFFFFFF;
   EMAC->MMC_FPE_TX_INTERRUPT_MASK = 0xFFFFFFFF;
   EMAC->MMC_FPE_RX_INTERRUPT_MASK = 0xFFFFFFFF;

