Oryx-Embedded/CycloneTCP/drivers/mac/mcxe31b_eth_driver.c
   //Disable MAC interrupts
   EMAC->MAC_INTERRUPT_ENABLE = 0;

   //Enable the desired DMA interrupts
   EMAC->DMA_CH[0].DMA_CHX_INT_EN = EMAC_DMA_CHX_INT_EN_NIE_MASK |
      EMAC_DMA_CHX_INT_EN_RIE_MASK | EMAC_DMA_CHX_INT_EN_TIE_MASK;

   //Set priority grouping (3 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(MCXE31B_ETH_IRQ_PRIORITY_GROUPING);

   //Configure Ethernet interrupt priority
   NVIC_SetPriority(EMAC_0_IRQn, NVIC_EncodePriority(MCXE31B_ETH_IRQ_PRIORITY_GROUPING,
      MCXE31B_ETH_IRQ_GROUP_PRIORITY, MCXE31B_ETH_IRQ_SUB_PRIORITY));

   //Enable MAC transmission and reception
   EMAC->MAC_CONFIGURATION |= EMAC_MAC_CONFIGURATION_TE_MASK |
      EMAC_MAC_CONFIGURATION_RE_MASK;

   //Enable DMA transmission and reception
   EMAC->DMA_CH[0].DMA_CHX_TX_CTRL |= EMAC_DMA_CHX_TX_CTRL_ST_MASK;
   EMAC->DMA_CH[0].DMA_CHX_RX_CTRL |= EMAC_DMA_CHX_RX_CTRL_SR_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void mcxe31bEthInitGpio(NetInterface *interface)
{
//FRDM-MCXE31B evaluation board?
#if defined(USE_FRDM_MCXE31B)
   //Select RMII interface mode
   DCM_GPR->DCMRWF1 |= DCM_GPR_DCMRWF1_RMII_MII_SEL_MASK;

   //Configure MII_RMII_TX_CLK (PTD11)
   SIUL2_SetPinInputBuffer(SIUL2, 107, true, 296, kPORT_INPUT_MUX_ALT1);

   //Configure MII_RMII_TX_EN (PTD12)
   SIUL2_SetPinOutputBuffer(SIUL2, 108, true, kPORT_MUX_ALT5);
   //Configure MII_RMII_TXD0 (PTC2)
   SIUL2_SetPinOutputBuffer(SIUL2, 66, true, kPORT_MUX_ALT5);
   //Configure MII_RMII_TXD1 (PTD7)
   SIUL2_SetPinOutputBuffer(SIUL2, 103, true, kPORT_MUX_ALT5);

   //Configure MII_RMII_RX_DV (PTC17)
   SIUL2_SetPinInputBuffer(SIUL2, 81, true, 292, kPORT_INPUT_MUX_ALT1);
   //Configure MII_RMII_RXD0 (PTC1)
   SIUL2_SetPinInputBuffer(SIUL2, 65, true, 294, kPORT_INPUT_MUX_ALT1);
   //Configure MII_RMII_RXD1 (PTC0)
   SIUL2_SetPinInputBuffer(SIUL2, 64, true, 295, kPORT_INPUT_MUX_ALT1);

   //Configure MII_RMII_MDC (PTB5)
   SIUL2_SetPinOutputBuffer(SIUL2, 37, true, kPORT_MUX_ALT7);

   //Configure MII_RMII_MDIO (PTB4)
   SIUL2_SetPinOutputBuffer(SIUL2, 36, true, kPORT_MUX_ALT5);
   SIUL2_SetPinInputBuffer(SIUL2, 36, true, 291, kPORT_INPUT_MUX_ALT1);

   //Configure ENET_PHY_RST (PTC3) as an output
   SIUL2_SetPinOutputBuffer(SIUL2, 67, true, kPORT_MUX_AS_GPIO);

   //Reset PHY transceiver (hard reset)
   SIUL2_PortPinWrite(SIUL2, kSIUL2_PTC, 3, 0);
   sleep(10);
   SIUL2_PortPinWrite(SIUL2, kSIUL2_PTC, 3, 1);
   sleep(10);

   //Configure RMII clocks
   CLOCK_SetEmacRmiiTxClkFreq(50000000);
   CLOCK_AttachClk(kEMAC_RMII_TX_CLK_to_EMAC_TX);
   CLOCK_AttachClk(kEMAC_RMII_TX_CLK_to_EMAC_RX);
   CLOCK_AttachClk(kEMAC_RMII_TX_CLK_to_EMAC_TS);
   CLOCK_SetClkDiv(kCLOCK_DivEmacRxClk, 2);
   CLOCK_SetClkDiv(kCLOCK_DivEmacTxClk, 2);
   CLOCK_SetClkDiv(kCLOCK_DivEmacTsClk, 1);
#endif
}


/**
 * @brief Initialize DMA descriptor lists
 * @param[in] interface Underlying network interface
 **/

void mcxe31bEthInitDmaDesc(NetInterface *interface)
{
   uint_t i;

   //Initialize TX DMA descriptor list
   for(i = 0; i < MCXE31B_ETH_TX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the application
      txDmaDesc[i].tdes0 = 0;
      txDmaDesc[i].tdes1 = 0;
      txDmaDesc[i].tdes2 = 0;
      txDmaDesc[i].tdes3 = 0;
   }

   //Initialize TX descriptor index
   txIndex = 0;

   //Initialize RX DMA descriptor list
   for(i = 0; i < MCXE31B_ETH_RX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the DMA
      rxDmaDesc[i].rdes0 = MEMORY_ConvertMemoryMapAddress(
         (uint32_t) rxBuffer[i], kMEMORY_Local2DMA);

      rxDmaDesc[i].rdes1 = 0;
      rxDmaDesc[i].rdes2 = 0;
      rxDmaDesc[i].rdes3 = EMAC_RDES3_OWN | EMAC_RDES3_IOC | EMAC_RDES3_BUF1V;
   }

   //Initialize RX descriptor index
   rxIndex = 0;

   //Start location of the TX descriptor list
   EMAC->DMA_CH[0].DMA_CHX_TXDESC_LIST_ADDR = MEMORY_ConvertMemoryMapAddress(
      (uint32_t) &txDmaDesc[0], kMEMORY_Local2DMA);

   //Length of the transmit descriptor ring
   EMAC->DMA_CH[0].DMA_CHX_TXDESC_RING_LENGTH = MCXE31B_ETH_TX_BUFFER_COUNT - 1;

   //Start location of the RX descriptor list
   EMAC->DMA_CH[0].DMA_CHX_RXDESC_LIST_ADDR = MEMORY_ConvertMemoryMapAddress(
      (uint32_t) &rxDmaDesc[0], kMEMORY_Local2DMA);

   //Length of the receive descriptor ring
   EMAC->DMA_CH[0].DMA_CHX_RXDESC_RING_LENGTH = MCXE31B_ETH_RX_BUFFER_COUNT - 1;
}


/**
 * @brief MCX E31B Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void mcxe31bEthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void mcxe31bEthEnableIrq(NetInterface *interface)
{
   //Enable Ethernet MAC interrupts
   NVIC_EnableIRQ(EMAC_0_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void mcxe31bEthDisableIrq(NetInterface *interface)
{
   //Disable Ethernet MAC interrupts
   NVIC_DisableIRQ(EMAC_0_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief MCX E31B Ethernet MAC interrupt service routine
 **/

void EMAC_0_IRQHandler(void)
{
   bool_t flag;
   uint32_t status;

   //Interrupt service routine prologue
   osEnterIsr();

   //This flag will be set if a higher priority task must be woken
   flag = FALSE;

   //Read DMA status register
   status = EMAC->DMA_CH[0].DMA_CHX_STAT;

   //Packet transmitted?
   if((status & EMAC_DMA_CHX_STAT_TI_MASK) != 0)
   {
      //Clear TI interrupt flag
      EMAC->DMA_CH[0].DMA_CHX_STAT = EMAC_DMA_CHX_STAT_TI_MASK;

